etc/template_files/WTTH_ADDCONFIGELEMENT_NNC.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:con="http://configmgmt.service.ws.ems.acmepacket.com/">
        <soapenv:Header/>
        <soapenv:Body>
                <con:addConfigElement>
                        <targetName>sbclab</targetName>
                        <wsConfigElement>
                                <attributeList>
                                        <name>realmID</name>
                                        <value>HOME-ZONE-PEER</value>
                                </attributeList>
                                <attributeList>
                                        <name>customerRoute</name>
                                        <value>172.18.253.44</value>
                                </attributeList>
                                <attributeList>
                                        <name>contactHost</name>
                                        <value>172.18.253.44</value>
                                </attributeList>
                                <attributeList>
                                        <name>contactUser</name>
                                        <value>%fixed_number%</value>
                                </attributeList>
                                <attributeList>
                                        <name>registerHost</name>
                                        <value>ims.claro.com.co</value>
                                </attributeList>
                                <attributeList>
                                        <name>registerUser</name>
                                        <value>%fixed_number%</value>
                                </attributeList>
                                <attributeList>
                                        <name>customerHost</name>
                                        <value>172.31.212.6</value>
                                </attributeList>
                                <attributeList>
                                        <name>password</name>
                                        <value>%password%</value>
                                </attributeList>
                                <attributeList>
                                        <name>expires</name>
                                        <value>3600</value>
                                </attributeList>
                                <attributeList>
                                        <name>authUser</name>
                                        <value>%fixed_number%@ims.claro.com.co</value>
                                </attributeList>
                                <elementTypePath>surrogateAgent</elementTypePath>
                                <type>surrogateAgent</type>
                        </wsConfigElement>
                </con:addConfigElement>
        </soapenv:Body>
</soapenv:Envelope>
